RT-Thread/rt-thread/bsp/synwit/swm341/libraries/SWM341_StdPeriph_Driver/SWM341_timr.c
/******************************************************************************************************************************************
* 文件名称: SWM341_timr.c
* 功能说明: SWM341单片机的计数器/定时器功能驱动库
* 技术支持: http://www.synwit.com.cn/e/tool/gbook/?bid=1
* 注意事项:
* 版本日期: V1.0.0      2016年1月30日
* 升级记录:
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology
*******************************************************************************************************************************************/
#include "SWM341.h"
#include "SWM341_timr.h"


/******************************************************************************************************************************************
* 函数名称: TIMR_Init()
* 功能说明: TIMR定时器/计数器初始化
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，有效值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
*           uint32_t mode           对于TIMR0~4: TIMR_MODE_TIMER、TIMR_MODE_COUNTER、TIMR_MODE_OC、TIMR_MODE_IC
*                                   对于BTIMR0~11: TIMR_MODE_TIMER、TIMR_MODE_OC
*           uint16_t prediv         预分频，取值1-256
*           uint32_t period         定时/计数周期，取值1-16777216
*           uint32_t int_en         中断使能
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_Init(TIMR_TypeDef * TIMRx, uint32_t mode, uint16_t prediv, uint32_t period, uint32_t int_en)
{
    if((TIMRx == TIMR0) || (TIMRx == TIMR1) || (TIMRx == TIMR2) || (TIMRx == TIMR3) || (TIMRx == TIMR4))
    {
        SYS->CLKEN0 |= (0x01 << SYS_CLKEN0_TIMR_Pos);
    }
    else
    {
        SYS->CLKEN1 |= (0x01 << SYS_CLKEN1_BTIMR_Pos);
    }

    TIMR_Stop(TIMRx);   //一些关键寄存器只能在定时器停止时设置

    TIMRx->CR &= ~(TIMR_CR_MODE_Msk | TIMR_CR_CLKSRC_Msk);
    TIMRx->CR |= (mode << TIMR_CR_CLKSRC_Pos);

    TIMRx->PREDIV = prediv - 1;

    TIMRx->LOAD = period - 1;

    TIMRx->IF = (1 << TIMR_IF_TO_Pos);      //清除中断标志
    if(int_en) TIMRx->IE |=  (1 << TIMR_IE_TO_Pos);
    else       TIMRx->IE &= ~(1 << TIMR_IE_TO_Pos);

    switch((uint32_t)TIMRx)
    {
    case ((uint32_t)TIMR0):
        if(int_en) NVIC_EnableIRQ(TIMR0_IRQn);
        break;

    case ((uint32_t)TIMR1):
        if(int_en) NVIC_EnableIRQ(TIMR1_IRQn);
        break;

    case ((uint32_t)TIMR2):
        if(int_en) NVIC_EnableIRQ(TIMR2_IRQn);
        break;

    case ((uint32_t)TIMR3):
        if(int_en) NVIC_EnableIRQ(TIMR3_IRQn);
        break;

    case ((uint32_t)TIMR4):
        if(int_en) NVIC_EnableIRQ(TIMR4_IRQn);
        break;

    case ((uint32_t)BTIMR0):
        if(int_en) NVIC_EnableIRQ(BTIMR0_IRQn);
        break;

    case ((uint32_t)BTIMR1):
        if(int_en) NVIC_EnableIRQ(BTIMR1_IRQn);
        break;

    case ((uint32_t)BTIMR2):
        if(int_en) NVIC_EnableIRQ(BTIMR2_IRQn);
        break;

    case ((uint32_t)BTIMR3):
        if(int_en) NVIC_EnableIRQ(BTIMR3_IRQn);
        break;

    case ((uint32_t)BTIMR4):
        if(int_en) NVIC_EnableIRQ(BTIMR4_IRQn);
        break;

    case ((uint32_t)BTIMR5):
        if(int_en) NVIC_EnableIRQ(BTIMR5_IRQn);
        break;

    case ((uint32_t)BTIMR6):
        if(int_en) NVIC_EnableIRQ(BTIMR6_IRQn);
        break;

    case ((uint32_t)BTIMR7):
        if(int_en) NVIC_EnableIRQ(BTIMR7_IRQn);
        break;

    case ((uint32_t)BTIMR8):
        if(int_en) NVIC_EnableIRQ(BTIMR8_IRQn);
        break;

    case ((uint32_t)BTIMR9):
        if(int_en) NVIC_EnableIRQ(BTIMR9_IRQn);
        break;

    case ((uint32_t)BTIMR10):
        if(int_en) NVIC_EnableIRQ(BTIMR10_IRQn);
        break;

    case ((uint32_t)BTIMR11):
        if(int_en) NVIC_EnableIRQ(BTIMR11_IRQn);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: TIMR_Start()
* 功能说明: 启动定时器，从初始值开始计时/计数
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_Start(TIMR_TypeDef * TIMRx)
{
    switch((uint32_t)TIMRx)
    {
    case ((uint32_t)TIMR0):
        TIMRG->EN |= (1 << TIMRG_EN_TIMR0_Pos);
        break;

    case ((uint32_t)TIMR1):
        TIMRG->EN |= (1 << TIMRG_EN_TIMR1_Pos);
        break;

    case ((uint32_t)TIMR2):
        TIMRG->EN |= (1 << TIMRG_EN_TIMR2_Pos);
        break;

    case ((uint32_t)TIMR3):
        TIMRG->EN |= (1 << TIMRG_EN_TIMR3_Pos);
        break;

    case ((uint32_t)TIMR4):
        TIMRG->EN |= (1 << TIMRG_EN_TIMR4_Pos);
        break;

    case ((uint32_t)BTIMR0):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR0_Pos);
        break;

    case ((uint32_t)BTIMR1):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR1_Pos);
        break;

    case ((uint32_t)BTIMR2):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR2_Pos);
        break;

    case ((uint32_t)BTIMR3):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR3_Pos);
        break;

    case ((uint32_t)BTIMR4):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR4_Pos);
        break;

    case ((uint32_t)BTIMR5):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR5_Pos);
        break;

    case ((uint32_t)BTIMR6):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR6_Pos);
        break;

    case ((uint32_t)BTIMR7):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR7_Pos);
        break;

    case ((uint32_t)BTIMR8):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR8_Pos);
        break;

    case ((uint32_t)BTIMR9):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR9_Pos);
        break;

    case ((uint32_t)BTIMR10):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR10_Pos);
        break;

    case ((uint32_t)BTIMR11):
        BTIMRG->EN |= (1 << TIMRG_EN_TIMR11_Pos);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: TIMR_Stop()
* 功能说明: 停止定时器
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_Stop(TIMR_TypeDef * TIMRx)
{
    switch((uint32_t)TIMRx)
    {
    case ((uint32_t)TIMR0):
        TIMRG->EN &= ~(1 << TIMRG_EN_TIMR0_Pos);
        break;

    case ((uint32_t)TIMR1):
        TIMRG->EN &= ~(1 << TIMRG_EN_TIMR1_Pos);
        break;

    case ((uint32_t)TIMR2):
        TIMRG->EN &= ~(1 << TIMRG_EN_TIMR2_Pos);
        break;

