RT-Thread/rt-thread/bsp/synwit/swm341/libraries/SWM341_StdPeriph_Driver/SWM341_timr.c
    case ((uint32_t)TIMR3):
        TIMRG->EN &= ~(1 << TIMRG_EN_TIMR3_Pos);
        break;

    case ((uint32_t)TIMR4):
        TIMRG->EN &= ~(1 << TIMRG_EN_TIMR4_Pos);
        break;

    case ((uint32_t)BTIMR0):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR0_Pos);
        break;

    case ((uint32_t)BTIMR1):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR1_Pos);
        break;

    case ((uint32_t)BTIMR2):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR2_Pos);
        break;

    case ((uint32_t)BTIMR3):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR3_Pos);
        break;

    case ((uint32_t)BTIMR4):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR4_Pos);
        break;

    case ((uint32_t)BTIMR5):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR5_Pos);
        break;

    case ((uint32_t)BTIMR6):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR6_Pos);
        break;

    case ((uint32_t)BTIMR7):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR7_Pos);
        break;

    case ((uint32_t)BTIMR8):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR8_Pos);
        break;

    case ((uint32_t)BTIMR9):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR9_Pos);
        break;

    case ((uint32_t)BTIMR10):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR10_Pos);
        break;

    case ((uint32_t)BTIMR11):
        BTIMRG->EN &= ~(1 << TIMRG_EN_TIMR11_Pos);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: TIMR_Halt()
* 功能说明: 暂停定时器，计数值保持不变
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_Halt(TIMR_TypeDef * TIMRx)
{
    TIMRx->HALT = 1;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_Resume()
* 功能说明: 恢复定时器，从暂停处继续计数
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_Resume(TIMR_TypeDef * TIMRx)
{
    TIMRx->HALT = 0;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_GetCurValue()
* 功能说明: 获取当前计数值
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: uint32_t              当前计数值
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_GetCurValue(TIMR_TypeDef * TIMRx)
{
    return TIMRx->VALUE;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_INTEn()
* 功能说明: 使能中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_INTEn(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE |= (1 << TIMR_IE_TO_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_INTDis()
* 功能说明: 禁能中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_INTDis(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE &= ~(1 << TIMR_IE_TO_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_INTClr()
* 功能说明: 清除中断标志
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_INTClr(TIMR_TypeDef * TIMRx)
{
    TIMRx->IF = (1 << TIMR_IF_TO_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_INTStat()
* 功能说明: 获取中断状态
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: uint32_t              0 TIMRx未产生中断    1 TIMRx产生了中断
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_INTStat(TIMR_TypeDef * TIMRx)
{
    return (TIMRx->IF & TIMR_IF_TO_Msk) ? 1 : 0;
}


/******************************************************************************************************************************************
* 函数名称: TIMR_OC_Init()
* 功能说明: 输出比较功能初始化
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
*           uint32_t match          当计数器的值递减到match时引脚输出电平翻转
*           uint32_t match_int_en   当计数器的值递减到match时是否产生中断
*           uint32_t init_lvl       初始输出电平
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_Init(TIMR_TypeDef * TIMRx, uint32_t match, uint32_t match_int_en, uint32_t init_lvl)
{
    TIMRx->OCMAT = match;
    if(init_lvl) TIMRx->OCCR |=  (1 << TIMR_OCCR_INITLVL_Pos);
    else         TIMRx->OCCR &= ~(1 << TIMR_OCCR_INITLVL_Pos);

    TIMRx->IF = (1 << TIMR_IF_OC0_Pos);     //清除中断标志
    if(match_int_en) TIMRx->IE |=  (1 << TIMR_IE_OC0_Pos);
    else             TIMRx->IE &= ~(1 << TIMR_IE_OC0_Pos);

    switch((uint32_t)TIMRx)
    {
    case ((uint32_t)TIMR0):
        if(match_int_en) NVIC_EnableIRQ(TIMR0_IRQn);
        break;

    case ((uint32_t)TIMR1):
        if(match_int_en) NVIC_EnableIRQ(TIMR1_IRQn);
        break;

    case ((uint32_t)TIMR2):
        if(match_int_en) NVIC_EnableIRQ(TIMR2_IRQn);
        break;

