RT-Thread/rt-thread/bsp/synwit/swm341/libraries/SWM341_StdPeriph_Driver/SWM341_timr.c
    case ((uint32_t)TIMR3):
        if(match_int_en) NVIC_EnableIRQ(TIMR3_IRQn);
        break;

    case ((uint32_t)TIMR4):
        if(match_int_en) NVIC_EnableIRQ(TIMR4_IRQn);
        break;

    case ((uint32_t)BTIMR0):
        if(match_int_en) NVIC_EnableIRQ(BTIMR0_IRQn);
        break;

    case ((uint32_t)BTIMR1):
        if(match_int_en) NVIC_EnableIRQ(BTIMR1_IRQn);
        break;

    case ((uint32_t)BTIMR2):
        if(match_int_en) NVIC_EnableIRQ(BTIMR2_IRQn);
        break;

    case ((uint32_t)BTIMR3):
        if(match_int_en) NVIC_EnableIRQ(BTIMR3_IRQn);
        break;

    case ((uint32_t)BTIMR4):
        if(match_int_en) NVIC_EnableIRQ(BTIMR4_IRQn);
        break;

    case ((uint32_t)BTIMR5):
        if(match_int_en) NVIC_EnableIRQ(BTIMR5_IRQn);
        break;

    case ((uint32_t)BTIMR6):
        if(match_int_en) NVIC_EnableIRQ(BTIMR6_IRQn);
        break;

    case ((uint32_t)BTIMR7):
        if(match_int_en) NVIC_EnableIRQ(BTIMR7_IRQn);
        break;

    case ((uint32_t)BTIMR8):
        if(match_int_en) NVIC_EnableIRQ(BTIMR8_IRQn);
        break;

    case ((uint32_t)BTIMR9):
        if(match_int_en) NVIC_EnableIRQ(BTIMR9_IRQn);
        break;

    case ((uint32_t)BTIMR10):
        if(match_int_en) NVIC_EnableIRQ(BTIMR10_IRQn);
        break;

    case ((uint32_t)BTIMR11):
        if(match_int_en) NVIC_EnableIRQ(BTIMR11_IRQn);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_OutputEn()
* 功能说明: 使能输出比较功能的波形输出
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_OutputEn(TIMR_TypeDef * TIMRx)
{
    TIMRx->OCCR &= ~(TIMR_OCCR_FORCEEN_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_OutputDis()
* 功能说明: 禁止输出比较功能的波形输出，且让输出比较功能引脚保持level电平
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
*           uint32_t level          禁止输出波形后在引脚上保持的电平
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_OutputDis(TIMR_TypeDef * TIMRx, uint32_t level)
{
    if(level) TIMRx->OCCR |=  (1 << TIMR_OCCR_FORCELVL_Pos);
    else      TIMRx->OCCR &= ~(1 << TIMR_OCCR_FORCELVL_Pos);

    TIMRx->OCCR |= (TIMR_OCCR_FORCEEN_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_SetMatch()
* 功能说明: 设置输出比较功能的比较值
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
*           uint32_t match          输出比较功能的比较值
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_SetMatch(TIMR_TypeDef * TIMRx, uint32_t match)
{
    TIMRx->OCMAT = match;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_GetMatch()
* 功能说明: 获取输出比较功能的比较值
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: uint32_t              输出比较功能的比较值
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_OC_GetMatch(TIMR_TypeDef * TIMRx)
{
    return TIMRx->OCMAT;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_INTEn()
* 功能说明: 使能输出比较中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_INTEn(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE |= (1 << TIMR_IE_OC0_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_INTDis()
* 功能说明: 禁能输出比较中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_INTDis(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE &= ~(1 << TIMR_IE_OC0_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_INTClr()
* 功能说明: 清除输出比较中断标志
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_OC_INTClr(TIMR_TypeDef * TIMRx)
{
    TIMRx->IF = (1 << TIMR_IF_OC0_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_OC_INTStat()
* 功能说明: 获取输出比较中断状态
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4、BTIMR0、BTIMR1、...、BTIMR11
* 输    出: uint32_t              0 输出比较match未发生   1 输出比较match发生
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_OC_INTStat(TIMR_TypeDef * TIMRx)
{
    return (TIMRx->IF & TIMR_IF_OC0_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_Init()
* 功能说明: 输入捕获功能初始化
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
*           uint32_t captureH_int_en    测量高电平长度完成中断使能
*           uint32_t captureL_int_en    测量低电平长度完成中断使能
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_Init(TIMR_TypeDef * TIMRx, uint32_t captureH_int_en, uint32_t captureL_int_en)
{
    TIMRx->IF = (TIMR_IF_ICR_Msk | TIMR_IF_ICF_Msk);
    if(captureH_int_en) TIMRx->IE |=  (1 << TIMR_IE_ICF_Pos);
    else                TIMRx->IE &= ~(1 << TIMR_IE_ICF_Pos);
    if(captureL_int_en) TIMRx->IE |=  (1 << TIMR_IE_ICR_Pos);
    else                TIMRx->IE &= ~(1 << TIMR_IE_ICR_Pos);

    switch((uint32_t)TIMRx)
    {
    case ((uint32_t)TIMR0):
        if(captureH_int_en | captureL_int_en) NVIC_EnableIRQ(TIMR0_IRQn);
        break;

    case ((uint32_t)TIMR1):
        if(captureH_int_en | captureL_int_en) NVIC_EnableIRQ(TIMR1_IRQn);
        break;

    case ((uint32_t)TIMR2):
        if(captureH_int_en | captureL_int_en) NVIC_EnableIRQ(TIMR2_IRQn);
        break;

