RT-Thread/rt-thread/bsp/synwit/swm341/libraries/SWM341_StdPeriph_Driver/SWM341_timr.c
    case ((uint32_t)TIMR3):
        if(captureH_int_en | captureL_int_en) NVIC_EnableIRQ(TIMR3_IRQn);
        break;

    case ((uint32_t)TIMR4):
        if(captureH_int_en | captureL_int_en) NVIC_EnableIRQ(TIMR4_IRQn);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_GetCaptureH()
* 功能说明: 获取高电平长度测量结果
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: uint32_t              高电平长度测量结果
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_IC_GetCaptureH(TIMR_TypeDef * TIMRx)
{
    return TIMRx->ICHIGH;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_GetCaptureL()
* 功能说明: 获取低电平长度测量结果
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: uint32_t              低电平长度测量结果
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_IC_GetCaptureL(TIMR_TypeDef * TIMRx)
{
    return TIMRx->ICLOW;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureH_INTEn()
* 功能说明: 使能输入捕获高电平长度测量完成中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureH_INTEn(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE |= (1 << TIMR_IE_ICF_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureH_INTDis()
* 功能说明: 禁能输入捕获高电平长度测量完成中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureH_INTDis(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE &= ~(1 << TIMR_IE_ICF_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureH_INTClr()
* 功能说明: 清除输入捕获高电平长度测量完成中断标志
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureH_INTClr(TIMR_TypeDef * TIMRx)
{
    TIMRx->IF = (1 << TIMR_IF_ICF_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureH_INTStat()
* 功能说明: 获取输入捕获高电平长度测量完成中断状态
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: uint32_t              0 高电平长度测量未完成    1 高电平长度测量完成
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_IC_CaptureH_INTStat(TIMR_TypeDef * TIMRx)
{
    return (TIMRx->IF & TIMR_IF_ICF_Msk) ? 1 : 0;
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureL_INTEn()
* 功能说明: 使能输入捕获低电平长度测量完成中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureL_INTEn(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE |= (1 << TIMR_IE_ICR_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureL_INTDis()
* 功能说明: 禁能输入捕获低电平长度测量完成中断
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureL_INTDis(TIMR_TypeDef * TIMRx)
{
    TIMRx->IE &= ~(1 << TIMR_IE_ICR_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureL_INTClr()
* 功能说明: 清除输入捕获低电平长度测量完成中断标志
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void TIMR_IC_CaptureL_INTClr(TIMR_TypeDef * TIMRx)
{
    TIMRx->IF = (1 << TIMR_IF_ICR_Pos);
}

/******************************************************************************************************************************************
* 函数名称: TIMR_IC_CaptureL_INTStat()
* 功能说明: 获取输入捕获低电平长度测量完成中断状态
* 输    入: TIMR_TypeDef * TIMRx  指定要被设置的定时器，可取值包括TIMR0、TIMR1、TIMR2、TIMR3、TIMR4
* 输    出: uint32_t              0 低电平长度测量未完成    1 低电平长度测量完成
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t TIMR_IC_CaptureL_INTStat(TIMR_TypeDef * TIMRx)
{
    return (TIMRx->IF & TIMR_IF_ICR_Msk) ? 1 : 0;
}
